In [13]:
import numpy as np
import pandas as pd


data = {
    'f_name': ['Dipak', 'Ramesh', 'Sita', 'Gita', 'Anup', 'Gita', 'Mira', 'Sundar', 'Manoj', 'Ganesh'],
    'l_name': ['Prasai', 'Ghale', 'Mahatara', 'Gurung', 'Bagale', 'Tamang', 'Shah', np.nan, 'Ghale', np.nan],
    'age': [32, 45, 21, 15, 36, np.nan, 85, 41, 32, 12],
    'weight': [65, 72, 55, 40, 58, 62, np.nan, 65, 55, 20], 
    'balance': [150000, 200000, 25000, 5000, 500000, 20000, 50000, 256000, 78000, 25000]
}

df = pd.DataFrame(data)

df

   f_name    l_name   age  weight  balance
0   Dipak    Prasai  32.0    65.0   150000
1  Ramesh     Ghale  45.0    72.0   200000
2    Sita  Mahatara  21.0    55.0    25000
3    Gita    Gurung  15.0    40.0     5000
4    Anup    Bagale  36.0    58.0   500000
5    Gita    Tamang   NaN    62.0    20000
6    Mira      Shah  85.0     NaN    50000
7  Sundar       NaN  41.0    65.0   256000
8   Manoj     Ghale  32.0    55.0    78000
9  Ganesh       NaN  12.0    20.0    25000

In [14]:
# Series
print(df['age'])
print(type(df['age']))

0    32.0
1    45.0
2    21.0
3    15.0
4    36.0
5     NaN
6    85.0
7    41.0
8    32.0
9    12.0
Name: age, dtype: float64
<class 'pandas.core.series.Series'>

In [15]:
# DataFrame
print(df[['age', 'weight']])
print(type(df[['age', 'weight']]))

    age  weight
0  32.0    65.0
1  45.0    72.0
2  21.0    55.0
3  15.0    40.0
4  36.0    58.0
5   NaN    62.0
6  85.0     NaN
7  41.0    65.0
8  32.0    55.0
9  12.0    20.0
<class 'pandas.core.frame.DataFrame'>

In [16]:
print("Null values in age column:", df['age'].isna().sum())
print("Null values in age column:", df['l_name'].isna().sum())

Null values in age column: 1
Null values in age column: 2

In [25]:
import numpy as np
import pandas as pd


data = {
    'f_name': ['Dipak', 'Ramesh', 'Sita', 'Gita', 'Anup', 'Gita', 'Mira', 'Sundar', 'Manoj', 'Ganesh'],
    'l_name': ['Prasai', 'Ghale', 'Mahatara', 'Gurung', 'Bagale', 'Tamang', 'Shah', np.nan, 'Ghale', np.nan],
    'age': [32, 45, 21, 15, 36, np.nan, 85, 41, 32, 12],
    'weight': [65, 72, 55, 40, 58, 62, np.nan, 65, 55, 20], 
    'balance': [150000, 200000, 25000, 5000, 500000, 20000, 50000, 256000, 78000, 25000]
}

df = pd.DataFrame(data)

# df['balance'].duplicated() # second occurance is considered as duplicated
df['balance'] = df['balance'].drop_duplicates()
print(df['balance'])

0    150000.0
1    200000.0
2     25000.0
3      5000.0
4    500000.0
5     20000.0
6     50000.0
7    256000.0
8     78000.0
9         NaN
Name: balance, dtype: float64